fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <comment>Разовые премии сотрудникам с автоматическим расчетом НДФЛ.</comment>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <comment>Месяц, в котором регистрируется премия.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <comment>Результаты расчета процента от работ и премий.</comment>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <comment>Результаты расчета НДФЛ.</comment>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <comment>Задолженность предприятия перед сотрудниками: приход - начисление, расход - выплата.</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПериодНачала = НачалоМесяца(ПериодРегистрации);
	
	// Премия регистрируется как дополнительное начисление, НДФЛ - как удержание
	// от суммы премий именно этого документа: иначе при нескольких документах
	// за месяц налог был бы удержан повторно с одной и той же базы.
	Для Каждого СтрокаПремии Из СписокСотрудников Цикл
		
		Если СтрокаПремии.СуммаПремии = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Начисление = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Начисление.ПериодРегистрации = ПериодНачала;
		Начисление.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Начисление.Сотрудник = СтрокаПремии.Сотрудник;
		Начисление.Результат = СтрокаПремии.СуммаПремии;
		
		Удержание = Движения.ВКМ_Удержания.Добавить();
		Удержание.ПериодРегистрации = ПериодНачала;
		Удержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Удержание.Сотрудник = СтрокаПремии.Сотрудник;
		Удержание.Результат = ВКМ_РасчетЗарплаты.РассчитатьНДФЛ(СтрокаПремии.СуммаПремии);
		
		Взаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Взаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		Взаиморасчеты.Период = Дата;
		Взаиморасчеты.Сотрудник = СтрокаПремии.Сотрудник;
		Взаиморасчеты.Сумма = СтрокаПремии.СуммаПремии
			- ВКМ_РасчетЗарплаты.РассчитатьНДФЛ(СтрокаПремии.СуммаПремии);
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
